Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
/*
 * STM32 CMSIS extensions
 *
 * (C) 2022-2026 Gissio
 *
 * License: MIT
 */

#ifndef _STM32_EXT_H_
#define _STM32_EXT_H_

#include <stdbool.h>
#include <stdint.h>

#include "stm32.h"

#if defined(STM32F0) && !defined(GD32)
#define MAX_SYSCLK 48000000
#elif defined(STM32F0) && defined(GD32)
#define MAX_SYSCLK 72000000
#elif defined(STM32F1) && defined(CH32F2)
#define MAX_SYSCLK 144000000
#elif defined(STM32F1)
#define MAX_SYSCLK 72000000
#elif defined(STM32G0)
#define MAX_SYSCLK 64000000
#elif defined(STM32L4)
#define MAX_SYSCLK 80000000
#endif

__STATIC_INLINE void stm32ExtUsleep(uint32_t value)
{
    for (volatile uint32_t i = 0; i < (uint32_t)(value * (MAX_SYSCLK / 1000000)); i++)
        ;
}

typedef struct
{
    uint32_t sp;
    void (*onReset)(void);
} VectorTable;

#if defined(STM32F0)
#define SYSTEM_VECTOR_TABLE ((VectorTable *)0x1fffec00)
#elif defined(STM32F1)
#define SYSTEM_VECTOR_TABLE ((VectorTable *)0x1ffff000)
#elif defined(STM32G0) || defined(STM32L4)
#define SYSTEM_VECTOR_TABLE ((VectorTable *)0x1fff0000)
#endif

#if defined(CH32F2)
#define RCC_APB2ENR_TIM9EN_Pos (19U)
#define RCC_APB2ENR_TIM9EN_Msk (0x1UL << RCC_APB2ENR_TIM9EN_Pos) /*!< 0x00100000 */
#define RCC_APB2ENR_TIM9EN RCC_APB2ENR_TIM9EN_Msk                /*!< TIM9 Timer clock enable  */
#define RCC_APB2ENR_TIM10EN_Pos (20U)
#define RCC_APB2ENR_TIM10EN_Msk (0x1UL << RCC_APB2ENR_TIM10EN_Pos) /*!< 0x00100000 */
#define RCC_APB2ENR_TIM10EN RCC_APB2ENR_TIM10EN_Msk                /*!< TIM10 Timer clock enable  */

#define TIM9_BASE (APB2PERIPH_BASE + 0x00004c00UL)
#define TIM9 ((TIM_TypeDef *)TIM9_BASE)

#define TIM10_BASE (APB2PERIPH_BASE + 0x00005000UL)
#define TIM10 ((TIM_TypeDef *)TIM10_BASE)
#endif

// RCC

#if defined(CH32F2)
#define RCC_CFGR_PLLSRC_HSI_DIV2 0
#define RCC_CFGR_PLLSRC_HSE RCC_CFGR_PLLSRC

#undef RCC_CFGR_USBPRE_Msk
#define RCC_CFGR_USBPRE_Msk (0x3UL << RCC_CFGR_USBPRE_Pos)
#define RCC_CFGR_USBPRE_DIV1 (0x0UL << RCC_CFGR_USBPRE_Pos)
#define RCC_CFGR_USBPRE_DIV2 (0x1UL << RCC_CFGR_USBPRE_Pos)
#define RCC_CFGR_USBPRE_DIV3 (0x2UL << RCC_CFGR_USBPRE_Pos)
#elif defined(STM32F1)
#define RCC_CFGR_PLLSRC_HSI_DIV2 0
#define RCC_CFGR_PLLSRC_HSE RCC_CFGR_PLLSRC

#define RCC_CFGR_USBPRE_DIV1 RCC_CFGR_USBPRE_Msk
#define RCC_CFGR_USBPRE_DIV1_5 0
#elif defined(STM32G0)
#define RCC_CR_HSIDIV_DIV1 (0x0 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV2 (0x1 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV4 (0x2 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV8 (0x3 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV16 (0x4 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV32 (0x5 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV64 (0x6 << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV128 (0x7 << RCC_CR_HSIDIV_Pos)

#define RCC_CFGR_SW_HSI 0x00000000U
#define RCC_CFGR_SW_HSE 0x00000001U
#define RCC_CFGR_SW_PLL 0x00000002U
#define RCC_CFGR_SW_LSI 0x00000003U
#define RCC_CFGR_SW_LSE 0x00000004U

#define RCC_CFGR_HPRE_DIV1 (0x0 << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV2 (0x8 << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV4 (0x9 << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV8 (0xa << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV16 (0xb << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV64 (0xc << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV128 (0xd << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV256 (0xe << RCC_CFGR_HPRE_Pos)
#define RCC_CFGR_HPRE_DIV512 (0xf << RCC_CFGR_HPRE_Pos)

#define RCC_CFGR_PPRE_DIV1 (0x0 << RCC_CFGR_PPRE_Pos)
#define RCC_CFGR_PPRE_DIV2 (0x4 << RCC_CFGR_PPRE_Pos)
#define RCC_CFGR_PPRE_DIV4 (0x5 << RCC_CFGR_PPRE_Pos)
#define RCC_CFGR_PPRE_DIV8 (0x6 << RCC_CFGR_PPRE_Pos)
#define RCC_CFGR_PPRE_DIV16 (0x7 << RCC_CFGR_PPRE_Pos)

#endif

__STATIC_INLINE void sync_peripheral(__IO uint32_t *address)
{
#if defined(STM32_SYNC_PERIPHERALS)
    *address;

    __DSB();
#endif
}

__STATIC_INLINE void rcc_enable_crc(void)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32G0)
    set_bits(RCC->AHBENR, RCC_AHBENR_CRCEN);
#elif defined(STM32L4)
    set_bits(RCC->AHB1ENR, RCC_AHB1ENR_CRCEN);
#endif
}

__STATIC_INLINE void rcc_disable_crc(void)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32G0)
    clear_bits(RCC->AHBENR, RCC_AHBENR_CRCEN);
#elif defined(STM32L4)
    clear_bits(RCC->AHB1ENR, RCC_AHB1ENR_CRCEN);
#endif
}

#if defined(STM32F1)
__STATIC_INLINE void rcc_enable_afio(void)
{
    set_bits(RCC->APB2ENR, RCC_APB2ENR_AFIOEN);
    sync_peripheral(&RCC->APB2ENR);
}

__STATIC_INLINE void rcc_disable_afio(void)
{
    clear_bits(RCC->APB2ENR, RCC_APB2ENR_AFIOEN);
}
#endif

__STATIC_INLINE void rcc_enable_adc(const ADC_TypeDef *base)
{
#if defined(STM32F0)
    set_bits(RCC->CR2, RCC_CR2_HSI14ON);
    wait_until_bits_set(RCC->CR2, RCC_CR2_HSI14RDY);

    set_bits(RCC->APB2ENR, RCC_APB2ENR_ADCEN);
    sync_peripheral(&RCC->APB2ENR);
#elif defined(STM32F1)
    if (base == ADC1)
        set_bits(RCC->APB2ENR, RCC_APB2ENR_ADC1EN);
#if defined(ADC2)
    else if (base == ADC2)
        set_bits(RCC->APB2ENR, RCC_APB2ENR_ADC2EN);
#endif
    sync_peripheral(&RCC->APB2ENR);
#elif defined(STM32G0)
    set_bits(RCC->APBENR2, RCC_APBENR2_ADCEN);
    sync_peripheral(&RCC->APBENR2);
#elif defined(STM32L4)
    set_bits(RCC->AHB2ENR, RCC_AHB2ENR_ADCEN);
#endif
}

__STATIC_INLINE void rcc_disable_adc(const ADC_TypeDef *base)
{
#if defined(STM32F0)
    clear_bits(RCC->CR2, RCC_CR2_HSI14ON);

    clear_bits(RCC->APB2ENR, RCC_APB2ENR_ADCEN);
#elif defined(STM32F1)
    if (base == ADC1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_ADC1EN);
#if defined(ADC2)
    else if (base == ADC2)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_ADC2EN);
#endif
#elif defined(STM32G0)
    clear_bits(RCC->APBENR2, RCC_APBENR2_ADCEN);
#elif defined(STM32L4)
    clear_bits(RCC->AHB2ENR, RCC_AHB2ENR_ADCEN);
#endif
}

__STATIC_INLINE void rcc_enable_tim(const TIM_TypeDef *base)
{
#if defined(STM32F0)
    if (base == TIM1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM2)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM3)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM6)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM6EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM14)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM14EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM15)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM16)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM17)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#elif defined(STM32F1)
    if (base == TIM1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM2)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM3)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);
        sync_peripheral(&RCC->APB1ENR);
    }
    else if (base == TIM4)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM4EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#if defined(TIM5)
    else if (base == TIM5)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM5EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#if defined(TIM6)
    else if (base == TIM6)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM6EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#if defined(TIM7)
    else if (base == TIM7)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_TIM7EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#if defined(TIM8)
    else if (base == TIM8)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#endif
#if defined(TIM9)
    else if (base == TIM9)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM9EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#endif
#if defined(TIM10)
    else if (base == TIM10)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM10EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#endif
#if defined(TIM11)
    else if (base == TIM11)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM11EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#endif
#if defined(TIM12)
    else if (base == TIM12)
    {
        set_bits(RCC->APB1ENR, RCC_APB2ENR_TIM12EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#if defined(TIM13)
    else if (base == TIM13)
    {
        set_bits(RCC->APB1ENR, RCC_APB2ENR_TIM13EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#if defined(TIM14)
    else if (base == TIM14)
    {
        set_bits(RCC->APB1ENR, RCC_APB2ENR_TIM14EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#elif defined(STM32G0)
    if (base == TIM1)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_TIM1EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == TIM3)
    {
        set_bits(RCC->APBENR1, RCC_APBENR1_TIM3EN);
        sync_peripheral(&RCC->APBENR1);
    }
    else if (base == TIM6)
    {
        set_bits(RCC->APBENR1, RCC_APBENR1_TIM6EN);
        sync_peripheral(&RCC->APBENR1);
    }
    else if (base == TIM7)
    {
        set_bits(RCC->APBENR1, RCC_APBENR1_TIM7EN);
        sync_peripheral(&RCC->APBENR1);
    }
    else if (base == TIM14)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_TIM14EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == TIM15)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_TIM15EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == TIM16)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_TIM16EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == TIM17)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_TIM17EN);
        sync_peripheral(&RCC->APBENR2);
    }
#elif defined(STM32L4)
    if (base == TIM1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM2)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
    else if (base == TIM6)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
    else if (base == TIM7)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
    else if (base == TIM15)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == TIM16)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
        sync_peripheral(&RCC->APB2ENR);
    }
#endif
}

