Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
__STATIC_INLINE void rcc_disable_tim(const TIM_TypeDef *base)
{
#if defined(STM32F0)
    if (base == TIM1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
    else if (base == TIM2)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);
    else if (base == TIM3)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);
    else if (base == TIM6)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM6EN);
    else if (base == TIM14)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM14EN);
    else if (base == TIM15)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
    else if (base == TIM16)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
    else if (base == TIM17)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);
#elif defined(STM32F1)
    if (base == TIM1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
    else if (base == TIM2)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);
    else if (base == TIM3)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);
    else if (base == TIM4)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM4EN);
#if defined(TIM5)
    else if (base == TIM5)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM5EN);
#endif
#if defined(TIM6)
    else if (base == TIM6)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM6EN);
#endif
#if defined(TIM7)
    else if (base == TIM7)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_TIM7EN);
#endif
#if defined(TIM8)
    else if (base == TIM8)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);
#endif
#if defined(TIM9)
    else if (base == TIM9)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM9EN);
#endif
#if defined(TIM10)
    else if (base == TIM10)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM10EN);
#endif
#if defined(TIM11)
    else if (base == TIM11)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM11EN);
#endif
#if defined(TIM12)
    else if (base == TIM12)
        clear_bits(RCC->APB1ENR, RCC_APB2ENR_TIM12EN);
#endif
#if defined(TIM13)
    else if (base == TIM13)
        clear_bits(RCC->APB1ENR, RCC_APB2ENR_TIM13EN);
#endif
#if defined(TIM14)
    else if (base == TIM14)
        clear_bits(RCC->APB1ENR, RCC_APB2ENR_TIM14EN);
#endif
#elif defined(STM32G0)
    if (base == TIM1)
        clear_bits(RCC->APBENR2, RCC_APBENR2_TIM1EN);
    else if (base == TIM3)
        clear_bits(RCC->APBENR1, RCC_APBENR1_TIM3EN);
    else if (base == TIM6)
        clear_bits(RCC->APBENR1, RCC_APBENR1_TIM6EN);
    else if (base == TIM7)
        clear_bits(RCC->APBENR1, RCC_APBENR1_TIM7EN);
    else if (base == TIM14)
        clear_bits(RCC->APBENR2, RCC_APBENR2_TIM14EN);
    else if (base == TIM15)
        clear_bits(RCC->APBENR2, RCC_APBENR2_TIM15EN);
    else if (base == TIM16)
        clear_bits(RCC->APBENR2, RCC_APBENR2_TIM16EN);
    else if (base == TIM17)
        clear_bits(RCC->APBENR2, RCC_APBENR2_TIM17EN);
#elif defined(STM32L4)
    if (base == TIM1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
    else if (base == TIM2)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN);
    else if (base == TIM6)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);
    else if (base == TIM7)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);
    else if (base == TIM15)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
    else if (base == TIM16)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
#endif
}

__STATIC_INLINE void rcc_enable_rtc(void)
{
#if defined(STM32F0)
    set_bits(RCC->APB1ENR, RCC_APB1ENR_PWREN);
    sync_peripheral(&RCC->APB1ENR);
#elif defined(STM32F1)
    set_bits(RCC->APB1ENR, RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN);
    sync_peripheral(&RCC->APB1ENR);
#elif defined(STM32G0)
    set_bits(RCC->APBENR1, RCC_APBENR1_PWREN | RCC_APBENR1_RTCAPBEN);
    sync_peripheral(&RCC->APBENR1);
#elif defined(STM32L4)
    set_bits(RCC->APB1ENR1, RCC_APB1ENR1_PWREN | RCC_APB1ENR1_RTCAPBEN);
    sync_peripheral(&RCC->APB1ENR1);
#endif
}

__STATIC_INLINE void rcc_disable_rtc(void)
{
#if defined(STM32F0)
    clear_bits(RCC->APB1ENR, RCC_APB1ENR_PWREN);
#elif defined(STM32F1)
    clear_bits(RCC->APB1ENR, RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN);
#elif defined(STM32G0)
    clear_bits(RCC->APBENR1, RCC_APBENR1_PWREN | RCC_APBENR1_RTCAPBEN);
#elif defined(STM32L4)
    clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_PWREN | RCC_APB1ENR1_RTCAPBEN);
#endif
}

__STATIC_INLINE void rcc_enable_usart(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1)
    if (base == USART1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#if defined(USART3)
    else if (base == USART3)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_USART3EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#endif
#elif defined(STM32G0)
    if (base == USART1)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_USART1EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APBENR1, RCC_APBENR1_USART2EN);
        sync_peripheral(&RCC->APBENR1);
    }
#elif defined(STM32L4)
    if (base == USART1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
    else if (base == USART3)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
#endif
}

__STATIC_INLINE void rcc_disable_usart(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1)
    if (base == USART1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
    else if (base == USART2)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
#elif defined(STM32G0)
    if (base == USART1)
        clear_bits(RCC->APBENR2, RCC_APBENR2_USART1EN);
    else if (base == USART2)
        clear_bits(RCC->APBENR1, RCC_APBENR1_USART2EN);
#elif defined(STM32L4)
    if (base == USART1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
    else if (base == USART2)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);
    else if (base == USART3)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);
#endif
}

__STATIC_INLINE void rcc_reset_usart(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1)
    if (base == USART1)
    {
        set_bits(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
        sync_peripheral(&RCC->APB2RSTR);
        clear_bits(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
        sync_peripheral(&RCC->APB2RSTR);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
        sync_peripheral(&RCC->APB1RSTR);
        clear_bits(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
        sync_peripheral(&RCC->APB1RSTR);
    }
#elif defined(STM32G0)
    if (base == USART1)
    {
        set_bits(RCC->APBRSTR2, RCC_APBRSTR2_USART1RST);
        sync_peripheral(&RCC->APBRSTR2);
        clear_bits(RCC->APBRSTR2, RCC_APBRSTR2_USART1RST);
        sync_peripheral(&RCC->APBRSTR2);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APBRSTR1, RCC_APBRSTR1_USART2RST);
        sync_peripheral(&RCC->APBRSTR1);
        clear_bits(RCC->APBRSTR1, RCC_APBRSTR1_USART2RST);
        sync_peripheral(&RCC->APBRSTR1);
    }
#elif defined(STM32L4)
    if (base == USART1)
    {
        set_bits(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
        sync_peripheral(&RCC->APB2RSTR);
        clear_bits(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
        sync_peripheral(&RCC->APB2RSTR);
    }
    else if (base == USART2)
    {
        set_bits(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST);
        sync_peripheral(&RCC->APB1RSTR1);
        clear_bits(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST);
        sync_peripheral(&RCC->APB1RSTR1);
    }
    else if (base == USART3)
    {
        set_bits(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST);
        sync_peripheral(&RCC->APB1RSTR1);
        clear_bits(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST);
        sync_peripheral(&RCC->APB1RSTR1);
    }
#endif
}

__STATIC_INLINE void rcc_enable_spi(const SPI_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1)
    if (base == SPI1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == SPI2)
    {
        set_bits(RCC->APB1ENR, RCC_APB1ENR_SPI2EN);
        sync_peripheral(&RCC->APB1ENR);
    }
#elif defined(STM32G0)
    if (base == SPI1)
    {
        set_bits(RCC->APBENR2, RCC_APBENR2_SPI1EN);
        sync_peripheral(&RCC->APBENR2);
    }
    else if (base == SPI2)
    {
        set_bits(RCC->APBENR1, RCC_APBENR1_SPI2EN);
        sync_peripheral(&RCC->APBENR1);
    }
#elif defined(STM32L4)
    if (base == SPI1)
    {
        set_bits(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
        sync_peripheral(&RCC->APB2ENR);
    }
    else if (base == SPI2)
    {
        set_bits(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);
        sync_peripheral(&RCC->APB1ENR1);
    }
#endif
}

