Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
__STATIC_INLINE void rcc_disable_spi(const SPI_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1)
    if (base == SPI1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
    else if (base == SPI2)
        clear_bits(RCC->APB1ENR, RCC_APB1ENR_SPI2EN);
#elif defined(STM32G0)
    if (base == SPI1)
        clear_bits(RCC->APBENR2, RCC_APBENR2_SPI1EN);
    else if (base == SPI2)
        clear_bits(RCC->APBENR1, RCC_APBENR1_SPI2EN);
#elif defined(STM32L4)
    if (base == SPI1)
        clear_bits(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
    else if (base == SPI2)
        clear_bits(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);
#endif
}

__STATIC_INLINE void rcc_enable_dma(const DMA_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32G0)
    if (base == DMA1)
        set_bits(RCC->AHBENR, RCC_AHBENR_DMA1EN);
#if defined(DMA2)
    else if (base == DMA2)
        set_bits(RCC->AHBENR, RCC_AHBENR_DMA2EN);
#endif
#elif defined(STM32L4)
    if (base == DMA1)
        set_bits(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);
    else if (base == DMA2)
        set_bits(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
#endif
}

__STATIC_INLINE void rcc_disable_dma(const DMA_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32G0)
    if (base == DMA1)
        clear_bits(RCC->AHBENR, RCC_AHBENR_DMA1EN);
#if defined(DMA2)
    else if (base == DMA2)
        clear_bits(RCC->AHBENR, RCC_AHBENR_DMA2EN);
#endif
#elif defined(STM32L4)
    if (base == DMA1)
        clear_bits(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);
    else if (base == DMA2)
        clear_bits(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
#endif
}

// CRC

__STATIC_INLINE void crc_reset(void)
{
    set_bits(CRC->CR, CRC_CR_RESET);
}

__STATIC_INLINE void crc_write(uint32_t data)
{
    CRC->DR = data;
}

__STATIC_INLINE uint32_t crc_read(void)
{
    return CRC->DR;
}

// FLASH

#if !defined(FLASH_ACR_LATENCY_0WS)
#define FLASH_ACR_LATENCY_0WS 0
#define FLASH_ACR_LATENCY_1WS FLASH_ACR_LATENCY_0
#define FLASH_ACR_LATENCY_2WS FLASH_ACR_LATENCY_1
#endif

#if defined(STM32F0)
#define FLASH_SR_ERRORS (FLASH_SR_WRPERR | \
                         FLASH_SR_PGERR)
#define FLASH_SR_CLEAR (FLASH_SR_EOP | \
                        FLASH_SR_ERRORS)
#elif defined(STM32F1)
#define FLASH_SR_ERRORS (FLASH_SR_WRPRTERR | \
                         FLASH_SR_PGERR)
#define FLASH_SR_CLEAR (FLASH_SR_EOP | \
                        FLASH_SR_ERRORS)
#elif defined(STM32G0)
#define FLASH_KEY1 0x45670123UL
#define FLASH_KEY2 0xCDEF89ABUL

#define FLASH_SR_ERRORS (FLASH_SR_OPTVERR | \
                         FLASH_SR_FASTERR | \
                         FLASH_SR_MISERR |  \
                         FLASH_SR_PGSERR |  \
                         FLASH_SR_SIZERR |  \
                         FLASH_SR_PGAERR |  \
                         FLASH_SR_WRPERR |  \
                         FLASH_SR_PROGERR | \
                         FLASH_SR_OPERR)
#define FLASH_SR_CLEAR (FLASH_SR_ERRORS | \
                        FLASH_SR_EOP)
#elif defined(STM32L4)
#define FLASH_KEY1 0x45670123UL
#define FLASH_KEY2 0xCDEF89ABUL

#define FLASH_SR_ERRORS (FLASH_SR_OPTVERR | \
                         FLASH_SR_RDERR |   \
                         FLASH_SR_FASTERR | \
                         FLASH_SR_MISERR |  \
                         FLASH_SR_PGSERR |  \
                         FLASH_SR_SIZERR |  \
                         FLASH_SR_PGAERR |  \
                         FLASH_SR_WRPERR |  \
                         FLASH_SR_PROGERR | \
                         FLASH_SR_OPERR)
#define FLASH_SR_CLEAR (FLASH_SR_ERRORS | \
                        FLASH_SR_EOP)
#endif

__STATIC_INLINE void flash_unlock(void)
{
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
}

__STATIC_INLINE void flash_lock(void)
{
    set_bits(FLASH->CR, FLASH_CR_LOCK);
}

__STATIC_INLINE void flash_wait_while_busy(void)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    wait_until_bits_clear(FLASH->SR, FLASH_SR_BSY);
#elif defined(STM32G0)
    wait_until_bits_clear(FLASH->SR, FLASH_SR_BSY1);
#endif
}

__STATIC_INLINE void flash_clear_status(void)
{
    FLASH->SR = FLASH_SR_CLEAR;
}

__STATIC_INLINE bool flash_erase(uint32_t dest)
{
    flash_wait_while_busy();
    flash_clear_status();

    set_bits(FLASH->CR, FLASH_CR_PER);
#if defined(STM32F0) || defined(STM32F1)
    FLASH->AR = dest;
#elif defined(STM32G0) || defined(STM32L4)
    modify_bits(FLASH->CR,
                FLASH_CR_PNB_Msk,
                ((dest / FLASH_PAGE_SIZE) << FLASH_CR_PNB_Pos));
#endif
    set_bits(FLASH->CR, FLASH_CR_STRT);
    flash_wait_while_busy();

    clear_bits(FLASH->CR, FLASH_CR_PER);

    return (get_bits(FLASH->SR, FLASH_SR_ERRORS) == 0);
}

__STATIC_INLINE bool flash_program(uint8_t *dest, const uint8_t *source)
{
    flash_wait_while_busy();
    flash_clear_status();

    set_bits(FLASH->CR, FLASH_CR_PG);
#if defined(STM32F0) || defined(STM32F1)
    ((uint16_t *)dest)[0] = ((uint16_t *)source)[0];
#elif defined(STM32G0) || defined(STM32L4)
    ((uint32_t *)dest)[0] = ((uint32_t *)source)[0];
    ((uint32_t *)dest)[1] = ((uint32_t *)source)[1];
#endif
    flash_wait_while_busy();

    clear_bits(FLASH->CR, FLASH_CR_PG);

    return (get_bits(FLASH->SR, FLASH_SR_ERRORS) == 0);
}

// GPIO

#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)

#define GPIO_MODE_INPUT 0b00
#define GPIO_MODE_OUTPUT 0b01
#define GPIO_MODE_AF 0b10
#define GPIO_MODE_ANALOG 0b11

#define GPIO_OUTPUTTYPE_NONE 0
#define GPIO_OUTPUTTYPE_PUSHPULL 0
#define GPIO_OUTPUTTYPE_OPENDRAIN 1

#define GPIO_OUTPUTSPEED_NONE 0
#define GPIO_OUTPUTSPEED_2MHZ 0b00
#define GPIO_OUTPUTSPEED_10MHZ 0b01
#define GPIO_OUTPUTSPEED_50MHZ 0b11

#define GPIO_PULL_FLOATING 0b00
#define GPIO_PULL_PULLUP 0b01
#define GPIO_PULL_PULLDOWN 0b10

#define GPIO_AF_NONE 0b00
#define GPIO_AF0 0
#define GPIO_AF1 1
#define GPIO_AF2 2
#define GPIO_AF3 3
#define GPIO_AF4 4
#define GPIO_AF5 5
#define GPIO_AF6 6
#define GPIO_AF7 7

