Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
__STATIC_INLINE void gpio_setup(GPIO_TypeDef *base, uint8_t pin, uint8_t mode, uint8_t output_type, uint8_t output_speed, uint8_t pull, uint8_t af)
{
    uint32_t shift2 = 2 * pin;
    uint32_t mask2 = 0b11 << shift2;

    modify_bits(base->MODER,
                mask2,
                mode << shift2);

    if ((mode == GPIO_MODE_OUTPUT) ||
        (mode == GPIO_MODE_AF))
    {
        uint32_t shift1 = pin;
        uint32_t mask1 = 1 << shift1;

        modify_bits(base->OTYPER,
                    mask1,
                    output_type << shift1);
        modify_bits(base->OSPEEDR,
                    mask2,
                    output_speed << shift2);
    }

    modify_bits(base->PUPDR,
                mask2,
                pull << shift2);

    if (mode == GPIO_MODE_AF)
    {
        if (pin < 8)
        {
            uint32_t shift4 = 4 * pin;
            modify_bits(base->AFR[0],
                        0b1111 << shift4,
                        af << shift4);
        }
        else
        {
            uint32_t shift4 = 4 * (pin - 8);
            modify_bits(base->AFR[1],
                        0b1111 << shift4,
                        af << shift4);
        }
    }
}

__STATIC_INLINE void gpio_setup_input(GPIO_TypeDef *base, uint8_t pin, uint8_t pull)
{
    gpio_setup(base,
               pin,
               GPIO_MODE_INPUT,
               GPIO_OUTPUTTYPE_NONE,
               GPIO_OUTPUTSPEED_NONE,
               pull,
               GPIO_AF_NONE);
}

__STATIC_INLINE void gpio_setup_output(GPIO_TypeDef *base, uint8_t pin, uint8_t output_type, uint8_t output_speed, uint8_t pull)
{
    gpio_setup(base,
               pin,
               GPIO_MODE_OUTPUT,
               output_type,
               output_speed,
               pull,
               GPIO_AF_NONE);
}

__STATIC_INLINE void gpio_setup_af(GPIO_TypeDef *base, uint8_t pin, uint8_t output_type, uint8_t output_speed, uint8_t pull, uint8_t af)
{
    gpio_setup(base,
               pin,
               GPIO_MODE_AF,
               output_type,
               output_speed,
               pull,
               af);
}

__STATIC_INLINE void gpio_setup_analog(GPIO_TypeDef *base, uint8_t pin, uint8_t pull)
{
    gpio_setup(base,
               pin,
               GPIO_MODE_ANALOG,
               GPIO_OUTPUTTYPE_NONE,
               GPIO_OUTPUTSPEED_NONE,
               pull,
               GPIO_AF_NONE);
}

#elif defined(STM32F1)

#define GPIO_MODE_INPUT_ANALOG 0b0000
#define GPIO_MODE_INPUT_FLOATING 0b0100
#define GPIO_MODE_INPUT_PULLDOWN 0b01000
#define GPIO_MODE_INPUT_PULLUP 0b11000
#define GPIO_MODE_OUTPUT_2MHZ_PUSHPULL 0b0010
#define GPIO_MODE_OUTPUT_2MHZ_OPENDRAIN 0b0110
#define GPIO_MODE_OUTPUT_2MHZ_AF_PUSHPULL 0b1010
#define GPIO_MODE_OUTPUT_2MHZ_AF_OPENDRAIN 0b1110
#define GPIO_MODE_OUTPUT_10MHZ_PUSHPULL 0b0001
#define GPIO_MODE_OUTPUT_10MHZ_OPENDRAIN 0b0101
#define GPIO_MODE_OUTPUT_10MHZ_AF_PUSHPULL 0b1001
#define GPIO_MODE_OUTPUT_10MHZ_AF_OPENDRAIN 0b1101
#define GPIO_MODE_OUTPUT_50MHZ_PUSHPULL 0b0011
#define GPIO_MODE_OUTPUT_50MHZ_OPENDRAIN 0b0111
#define GPIO_MODE_OUTPUT_50MHZ_AF_PUSHPULL 0b1011
#define GPIO_MODE_OUTPUT_50MHZ_AF_OPENDRAIN 0b1111

#define GPIO_MODE_Msk 0b1111

__STATIC_INLINE void gpio_setup(GPIO_TypeDef *base, uint8_t pin, uint8_t mode)
{
    if (mode == GPIO_MODE_INPUT_PULLDOWN)
        clear_bits(base->ODR, get_bitvalue(pin));
    else if (mode == GPIO_MODE_INPUT_PULLUP)
        set_bits(base->ODR, get_bitvalue(pin));

    if (pin < 8)
    {
        uint32_t shift4 = 4 * pin;
        modify_bits(base->CRL,
                    GPIO_MODE_Msk << shift4,
                    (mode & GPIO_MODE_Msk) << shift4);
    }
    else
    {
        uint32_t shift4 = 4 * (pin - 8);
        modify_bits(base->CRH,
                    GPIO_MODE_Msk << shift4,
                    (mode & GPIO_MODE_Msk) << shift4);
    }
}

#endif

__STATIC_INLINE bool gpio_get(const GPIO_TypeDef *base, uint8_t pin)
{
    return get_bits(base->IDR, get_bitvalue(pin));
}

__STATIC_INLINE void gpio_set(GPIO_TypeDef *base, uint8_t pin)
{
    set_bits(base->ODR, get_bitvalue(pin));
}

__STATIC_INLINE void gpio_clear(GPIO_TypeDef *base, uint8_t pin)
{
    clear_bits(base->ODR, get_bitvalue(pin));
}

__STATIC_INLINE void gpio_modify(GPIO_TypeDef *base, uint8_t pin, bool value)
{
    base->BSRR = get_bitvalue(pin + (value ? 0 : 16));
}

// NVIC

__STATIC_INLINE void NVIC_DisableAllIRQs(void)
{
    for (uint8_t i = 0;
         i < sizeof(NVIC->ICER) / sizeof(uint32_t);
         i++)
    {
        NVIC->ICER[i] = 0xffffffff;
        NVIC->ICPR[i] = 0xffffffff;
    }
}

// EXTI

#if defined(STM32F0) || defined(STM32L4)
#define STM32EXT_EXTI SYSCFG
#elif defined(STM32F1)
#define STM32EXT_EXTI AFIO
#elif defined(STM32G0)
#define STM32EXT_EXTI EXTI
#endif

__STATIC_INLINE void exti_setup(const GPIO_TypeDef *base, uint8_t pin, bool rising_trigger, bool falling_trigger)
{
    uint32_t shift4 = 4 * (pin & 0b11);

    if (base == GPIOA)
        modify_bits(STM32EXT_EXTI->EXTICR[pin / 4],
                    0b1111 << shift4,
                    0 << shift4);
    else if (base == GPIOB)
        modify_bits(STM32EXT_EXTI->EXTICR[pin / 4],
                    0b1111 << shift4,
                    1 << shift4);
    else if (base == GPIOC)
        modify_bits(STM32EXT_EXTI->EXTICR[pin / 4],
                    0b1111 << shift4,
                    2 << shift4);
    else if (base == GPIOD)
        modify_bits(STM32EXT_EXTI->EXTICR[pin / 4],
                    0b1111 << shift4,
                    3 << shift4);
#if defined(GPIOF)
    else if (base == GPIOF)
        modify_bits(STM32EXT_EXTI->EXTICR[pin / 4],
                    0b1111 << shift4,
                    5 << shift4);
#endif

#if defined(STM32F0) || defined(STM32F1)
    modify_bits(EXTI->RTSR,
                1 << pin,
                rising_trigger << pin);
    modify_bits(EXTI->FTSR,
                1 << pin,
                falling_trigger << pin);
#elif defined(STM32G0) || defined(STM32L4)
    modify_bits(EXTI->RTSR1,
                1 << pin,
                rising_trigger << pin);
    modify_bits(EXTI->FTSR1,
                1 << pin,
                falling_trigger << pin);
#endif
}

__STATIC_INLINE void exti_enable_interrupt(uint8_t pin)
{
#if defined(STM32F0) || defined(STM32F1)
    set_bits(EXTI->IMR, get_bitvalue(pin));
#elif defined(STM32G0) || defined(STM32L4)
    set_bits(EXTI->IMR1, get_bitvalue(pin));
#endif
}

__STATIC_INLINE void exti_disable_interrupt(uint8_t pin)
{
#if defined(STM32F0) || defined(STM32F1)
    clear_bits(EXTI->IMR, get_bitvalue(pin));
#elif defined(STM32G0) || defined(STM32L4)
    clear_bits(EXTI->IMR1, get_bitvalue(pin));
#endif
}

__STATIC_INLINE void exti_clear_pending_interrupt(uint8_t pin)
{
#if defined(STM32F0) || defined(STM32F1)
    EXTI->PR = get_bitvalue(pin);
#elif defined(STM32G0)
    EXTI->RPR1 = get_bitvalue(pin);
    EXTI->FPR1 = get_bitvalue(pin);
#elif defined(STM32L4)
    EXTI->PR1 = get_bitvalue(pin);
#endif
}

// ADC

#if defined(STM32F0) && !defined(GD32)
#define ADC_TEMP_CHANNEL 16
#define ADC_VREF_CHANNEL 17
#define ADC_VBAT_CHANNEL 18
#elif defined(STM32F0) && defined(GD32)
#define ADC_TEMP_CHANNEL 16
#define ADC_VREF_CHANNEL 17
#elif defined(STM32F1)
#define ADC_TEMP_CHANNEL 16
#define ADC_VREF_CHANNEL 17
#elif defined(STM32G0)
#define ADC_TEMP_CHANNEL 12
#define ADC_VREF_CHANNEL 13
#define ADC_VBAT_CHANNEL 14
#elif defined(STM32L4)
#define ADC_VREF_CHANNEL 0
#define ADC_TEMP_CHANNEL 17
#define ADC_VBAT_CHANNEL 18
#endif

#if defined(STM32F0) && defined(GD32)

typedef struct
{
    __IO uint32_t STAT;   // ADC status register,                           Address offset: 0x00
    __IO uint32_t CTL0;   // ADC control register 0,                        Address offset: 0x04
    __IO uint32_t CTL1;   // ADC control register 1,                        Address offset: 0x08
    __IO uint32_t SAMPT0; // ADC sampling time register 1,                  Address offset: 0x0C
    __IO uint32_t SAMPT1; // ADC sampling time register 2,                  Address offset: 0x10
    __IO uint32_t IOFF0;  // ADC inserted channel data offset register 0,   Address offset: 0x14
    __IO uint32_t IOFF1;  // ADC inserted channel data offset register 1,   Address offset: 0x18
    __IO uint32_t IOFF2;  // ADC inserted channel data offset register 2,   Address offset: 0x1c
    __IO uint32_t IOFF3;  // ADC inserted channel data offset register 3,   Address offset: 0x20
    __IO uint32_t WDHT;   // ADC watchdog high threshold register,          Address offset: 0x24
    __IO uint32_t WDLT;   // ADC watchdog low threshold register,           Address offset: 0x28
    __IO uint32_t RSQ0;   // ADC routine sequence register 0,               Address offset: 0x2c
    __IO uint32_t RSQ1;   // ADC routine sequence register 1,               Address offset: 0x30
    __IO uint32_t RSQ2;   // ADC routine sequence register 2,               Address offset: 0x34
    __IO uint32_t ISQ;    // ADC inverted sequence register,                Address offset: 0x38
    __IO uint32_t IDATA0; // ADC inverted data register 0,                  Address offset: 0x3c
    __IO uint32_t IDATA1; // ADC inverted data register 1,                  Address offset: 0x40
    __IO uint32_t IDATA2; // ADC inverted data register 2,                  Address offset: 0x44
    __IO uint32_t IDATA3; // ADC inverted data register 3,                  Address offset: 0x48
    __IO uint32_t RDATA;  // ADC routine data register,                     Address offset: 0x4c
} ADC_GD32_TypeDef;

#define ADC_STAT_EOC_Pos (1U)
#define ADC_STAT_EOC_Msk (0x1UL << ADC_STAT_EOC_Pos) // 0x00000002
#define ADC_STAT_EOC ADC_STAT_EOC_Msk                // ADC EOC

#define ADC_CTL1_ADCON_Pos (0U)
#define ADC_CTL1_ADCON_Msk (0x1UL << ADC_CTL1_ADCON_Pos) // 0x00000001
#define ADC_CTL1_ADCON ADC_CTL1_ADCON_Msk                // ADC ON

