Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
#define ADC_CTL1_CLB_Pos (2U)
#define ADC_CTL1_CLB_Msk (0x1UL << ADC_CTL1_CLB_Pos) // 0x00000004
#define ADC_CTL1_CLB ADC_CTL1_CLB_Msk                // ADC calibration

#define ADC_CTL1_RSTCLB_Pos (3U)
#define ADC_CTL1_RSTCLB_Msk (0x1UL << ADC_CTL1_RSTCLB_Pos) // 0x00000008
#define ADC_CTL1_RSTCLB ADC_CTL1_RSTCLB_Msk                // Reset calibration

#define ADC_CTL1_ETSRC_Pos (17U)
#define ADC_CTL1_ETSRC_Msk (0x7UL << ADC_CTL1_ETSRC_Pos)    // 0x000E0000
#define ADC_CTL1_ETSRC ADC_CTL1_ETSRC_Msk                   // External trigger select for routine sequence
#define ADC_CTL1_ETSRC_0 (0x1UL << ADC_CTL1_ETSRC_Pos)      // 0x00020000
#define ADC_CTL1_ETSRC_1 (0x2UL << ADC_CTL1_ETSRC_Pos)      // 0x00040000
#define ADC_CTL1_ETSRC_2 (0x4UL << ADC_CTL1_ETSRC_Pos)      // 0x00080000
#define ADC_CTL1_ETSRC_TIM0CH0 (0x0 << ADC_CTL1_ETSRC_Pos)  // TIMER0 CH0
#define ADC_CTL1_ETSRC_TIM0CH1 (0x1 << ADC_CTL1_ETSRC_Pos)  // TIMER0 CH1
#define ADC_CTL1_ETSRC_TIM0CH2 (0x2 << ADC_CTL1_ETSRC_Pos)  // TIMER0 CH2
#define ADC_CTL1_ETSRC_TIM1CH1 (0x3 << ADC_CTL1_ETSRC_Pos)  // TIMER1 CH1
#define ADC_CTL1_ETSRC_TIM2TRGO (0x4 << ADC_CTL1_ETSRC_Pos) // TIMER2 TRGO
#define ADC_CTL1_ETSRC_TIM3CH0 (0x5 << ADC_CTL1_ETSRC_Pos)  // TIMER3 CH3
#define ADC_CTL1_ETSRC_EXTI11 (0x6 << ADC_CTL1_ETSRC_Pos)   // EXTI line 11
#define ADC_CTL1_ETSRC_SWRCST (0x7 << ADC_CTL1_ETSRC_Pos)   // SWRCST

#define ADC_CTL1_ETERC_Pos (20U)
#define ADC_CTL1_ETERC_Msk (0x1UL << ADC_CTL1_ETERC_Pos) // 0x00100000
#define ADC_CTL1_ETERC ADC_CTL1_ETERC_Msk                // External trigger enable for routine sequence

#define ADC_CTL1_SWRCST_Pos (22U)
#define ADC_CTL1_SWRCST_Msk (0x1UL << ADC_CTL1_SWRCST_Pos) // 0x00400000
#define ADC_CTL1_SWRCST ADC_CTL1_SWRCST_Msk                // Software start conversion of routine sequence

#define ADC_CTL1_TSVREN_Pos (23U)
#define ADC_CTL1_TSVREN_Msk (0x1UL << ADC_CTL1_TSVREN_Pos) // 0x00800000
#define ADC_CTL1_TSVREN ADC_CTL1_TSVREN_Msk                // Channel 16 and 17 enable of ADC

#define ADC_CTL1_VBATEN_Pos (24U)
#define ADC_CTL1_VBATEN_Msk (0x1UL << ADC_CTL1_VBATEN_Pos) // 0x01000000
#define ADC_CTL1_VBATEN ADC_CTL1_VBATEN_Msk                // Enable/disable the VBAT channel

#elif defined(STM32F1)

#define ADC_CR2_EXTSEL_TIM0CH0 (0x0 << ADC_CR2_EXTSEL_Pos)  // TIM1 CC1 event
#define ADC_CR2_EXTSEL_TIM0CH1 (0x1 << ADC_CR2_EXTSEL_Pos)  // TIM1 CC2 event
#define ADC_CR2_EXTSEL_TIM0CH2 (0x2 << ADC_CR2_EXTSEL_Pos)  // TIM1 CC3 event
#define ADC_CR2_EXTSEL_TIM1CH1 (0x3 << ADC_CR2_EXTSEL_Pos)  // TIM2 CC2 event
#define ADC_CR2_EXTSEL_TIM2TRGO (0x4 << ADC_CR2_EXTSEL_Pos) // TIM3 TRGO event
#define ADC_CR2_EXTSEL_TIM3CH0 (0x5 << ADC_CR2_EXTSEL_Pos)  // TIM4 CC4 event
#define ADC_CR2_EXTSEL_EXTI11 (0x6 << ADC_CR2_EXTSEL_Pos)   // EXTI line 11
#define ADC_CR2_EXTSEL_SWSTART (0x7 << ADC_CR2_EXTSEL_Pos)  // SWSTART

#endif

#if defined(STM32L4)

__STATIC_INLINE void adc_enable_deep_power_down(ADC_TypeDef *base)
{
    set_bits(base->CR, ADC_CR_DEEPPWD);
}

__STATIC_INLINE void adc_disable_deep_power_down(ADC_TypeDef *base)
{
    clear_bits(base->CR, ADC_CR_DEEPPWD);
}

#endif

#if defined(STM32G0) || defined(STM32L4)

__STATIC_INLINE void adc_enable_vreg(ADC_TypeDef *base)
{
    set_bits(base->CR, ADC_CR_ADVREGEN);

    stm32ExtUsleep(20);
}

__STATIC_INLINE void adc_disable_vreg(ADC_TypeDef *base)
{
    clear_bits(base->CR, ADC_CR_ADVREGEN);
}

#endif

__STATIC_INLINE void adc_enable(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    if (!get_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_ADCON))
    {
        set_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_ADCON);

        stm32ExtUsleep(1);
    }
#elif defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    set_bits(base->ISR, ADC_ISR_ADRDY);
    set_bits(base->CR, ADC_CR_ADEN);
    wait_until_bits_set(base->ISR, ADC_ISR_ADRDY);
#elif defined(STM32F1)
    if (!get_bits(base->CR2, ADC_CR2_ADON))
    {
        set_bits(base->CR2, ADC_CR2_ADON);

        stm32ExtUsleep(1);
    }
#endif
}

__STATIC_INLINE void adc_disable(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    clear_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_ADCON);
#elif defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    set_bits(base->CR, ADC_CR_ADDIS);
    wait_until_bits_clear(base->CR, ADC_CR_ADEN);
#elif defined(STM32F1)
    clear_bits(base->CR2, ADC_CR2_ADON);
#endif
}

__STATIC_INLINE void adc_calibrate(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    adc_enable(base);

    set_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_CLB);
    while (get_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_CLB))
        ;

    adc_disable(base);
#elif defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    set_bits(base->CR, ADC_CR_ADCAL);
    while (get_bits(base->CR, ADC_CR_ADCAL))
        ;
#elif defined(STM32F1)
    adc_enable(base);

    set_bits(base->CR2, ADC_CR2_CAL);
    while (get_bits(base->CR2, ADC_CR2_CAL))
        ;

    adc_disable(base);
#endif
}

__STATIC_INLINE void adc_enable_vref_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_VREFEN);

    stm32ExtUsleep(12);
#elif defined(STM32L4)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_VREFEN);

    stm32ExtUsleep(12);
#endif
}

__STATIC_INLINE void adc_disable_vref_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_VREFEN);
#elif defined(STM32L4)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_VREFEN);
#endif
}

__STATIC_INLINE void adc_enable_vbat_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    set_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_VBATEN);
#elif defined(STM32F0) || defined(STM32G0)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_VBATEN);
#elif defined(STM32L4)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_VBATEN);
#endif
}

