Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
__STATIC_INLINE void adc_disable_vbat_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    clear_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_VBATEN);
#elif defined(STM32F0) || defined(STM32G0)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_VBATEN);
#elif defined(STM32L4)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_VBATEN);
#endif
}

__STATIC_INLINE void adc_enable_temperature_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_TSEN);

    stm32ExtUsleep(12);
#elif defined(STM32L4)
    set_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_TSEN);

    stm32ExtUsleep(12);
#endif
}

__STATIC_INLINE void adc_disable_temperature_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x308))->CCR, ADC_CCR_TSEN);
#elif defined(STM32L4)
    clear_bits(((ADC_Common_TypeDef *)((uint8_t *)base + 0x300))->CCR, ADC_CCR_TSEN);
#endif
}

__STATIC_INLINE void adc_enable_temperature_vref_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    set_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_TSVREN);

    stm32ExtUsleep(12);
#elif defined(STM32F1)
    set_bits(base->CR2, ADC_CR2_TSVREFE);

    stm32ExtUsleep(12);
#endif
}

__STATIC_INLINE void adc_disable_temperature_vref_channel(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    clear_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_TSVREN);
#elif defined(STM32F1)
    clear_bits(base->CR2, ADC_CR2_TSVREFE);
#endif
}

__STATIC_INLINE void adc_set_channel(ADC_TypeDef *base, uint8_t channel)
{
#if defined(STM32F0) && defined(GD32)
    ((ADC_GD32_TypeDef *)base)->RSQ2 = channel;
#elif defined(STM32F0) || defined(STM32G0)
    base->CHSELR = get_bitvalue(channel);
#elif defined(STM32F1)
    base->SQR3 = channel;
#elif defined(STM32L4)
    base->SQR1 = (channel << ADC_SQR1_SQ1_Pos);
#endif
}

__STATIC_INLINE void adc_set_sampletime(ADC_TypeDef *base, uint8_t sampletime)
{
#if defined(STM32F0) && defined(GD32)
    ((ADC_GD32_TypeDef *)base)->RSQ0 = 0;

    modify_bits(((ADC_GD32_TypeDef *)base)->CTL1,
                ADC_CTL1_ETERC_Msk | ADC_CTL1_ETSRC_Msk,
                ADC_CTL1_ETERC | ADC_CTL1_ETSRC_SWRCST);

    uint32_t value = 0;
    for (uint32_t i = 0; i < 10; i++)
        value |= sampletime << (3 * i);
    ((ADC_GD32_TypeDef *)base)->SAMPT0 = value;
    ((ADC_GD32_TypeDef *)base)->SAMPT1 = value;
#elif defined(STM32F0) || defined(STM32G0)
    base->SMPR = sampletime;
#elif defined(STM32F1)
    base->SQR1 = 0;

    modify_bits(base->CR2,
                ADC_CR2_EXTTRIG_Msk | ADC_CR2_EXTSEL_Msk,
                ADC_CR2_EXTTRIG | ADC_CR2_EXTSEL_SWSTART);

    uint32_t value = 0;
    for (uint32_t i = 0; i < 10; i++)
        value |= sampletime << (3 * i);
    base->SMPR1 = value;
    base->SMPR2 = value;
#elif defined(STM32L4)
    uint32_t value = 0;
    for (uint32_t i = 0; i < 10; i++)
        value |= sampletime << (3 * i);
    base->SMPR1 = value;
    base->SMPR2 = value & 0b00000111111111111111111111111111;
#endif
}

__STATIC_INLINE void adc_trigger_conversion(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    set_bits(((ADC_GD32_TypeDef *)base)->CTL1, ADC_CTL1_SWRCST);
#elif defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    set_bits(base->CR, ADC_CR_ADSTART);
#elif defined(STM32F1)
    set_bits(base->CR2, ADC_CR2_SWSTART);
#endif
}

__STATIC_INLINE bool adc_ready(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    return get_bits(((ADC_GD32_TypeDef *)base)->STAT, ADC_STAT_EOC);
#elif defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    return get_bits(base->ISR, ADC_ISR_EOC);
#elif defined(STM32F1)
    return get_bits(base->SR, ADC_SR_EOC);
#endif
}

__STATIC_INLINE uint32_t adc_read(ADC_TypeDef *base)
{
#if defined(STM32F0) && defined(GD32)
    return ((ADC_GD32_TypeDef *)base)->RDATA;
#else
    return base->DR;
#endif
}

// TIM

#define TIM_CH1 0
#define TIM_CH2 1
#define TIM_CH3 2
#define TIM_CH4 3
#define TIM_CH1N 4
#define TIM_CH2N 5
#define TIM_CH3N 6

#define TIM_CR2_MMS_RESET (0b000 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_ENABLE (0b001 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_UPDATE (0b010 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_COMPARE_PULSE (0b011 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_COMPARE_OC1REF (0b100 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_COMPARE_OC2REF (0b101 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_COMPARE_OC3REF (0b110 << TIM_CR2_MMS_Pos)
#define TIM_CR2_MMS_COMPARE_OC4REF (0b111 << TIM_CR2_MMS_Pos)

#define TIM_SMCR_TS_ITR0 (0b000 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR1 (0b001 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR2 (0b010 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ITR3 (0b011 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI1F_ED (0b100 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI1FP1 (0b101 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_TI2FP2 (0b110 << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_ETRF (0b111 << TIM_SMCR_TS_Pos)

#define TIM_SMCR_SMS_OFF (0b000 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_EM1 (0b001 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_EM2 (0b010 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_EM3 (0b011 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_RM (0b100 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_GM (0b101 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_TM (0b110 << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_ECM1 (0b111 << TIM_SMCR_SMS_Pos)

__STATIC_INLINE void tim_enable(TIM_TypeDef *base)
{
    set_bits(base->CR1, TIM_CR1_CEN);
}

__STATIC_INLINE void tim_disable(TIM_TypeDef *base)
{
    clear_bits(base->CR1, TIM_CR1_CEN);
}

__STATIC_INLINE void tim_generate_update(TIM_TypeDef *base)
{
    set_bits(base->EGR, TIM_EGR_UG);
}

__STATIC_INLINE void tim_set_period(TIM_TypeDef *base, uint32_t value)
{
    base->ARR = value - 1;
}

