Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
__STATIC_INLINE void tim_set_prescaler_factor(TIM_TypeDef *base, uint32_t value)

{
    base->PSC = value - 1;
}

__STATIC_INLINE void tim_set_ontime(TIM_TypeDef *base, uint32_t channel, uint32_t ontime)
{
    switch (channel)
    {
    case TIM_CH1:
    case TIM_CH1N:
        base->CCR1 = ontime;

        break;

    case TIM_CH2:
    case TIM_CH2N:
        base->CCR2 = ontime;

        break;

    case TIM_CH3:
    case TIM_CH3N:
        base->CCR3 = ontime;

        break;

    case TIM_CH4:
        base->CCR4 = ontime;

        break;

    default:
        break;
    }
}

__STATIC_INLINE void tim_setup_pwm(TIM_TypeDef *base, uint32_t channel)
{
    switch (channel)
    {
    case TIM_CH1:
        modify_bits(base->CCMR1,
                    TIM_CCMR1_OC1M_Msk,
                    TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC1E_Msk | TIM_CCER_CC1P_Msk | TIM_CCER_CC1NE_Msk | TIM_CCER_CC1NP_Msk,
                    TIM_CCER_CC1E);

        break;

    case TIM_CH2:
        modify_bits(base->CCMR1,
                    TIM_CCMR1_OC2M_Msk,
                    TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC2E_Msk | TIM_CCER_CC2P_Msk | TIM_CCER_CC2NE_Msk | TIM_CCER_CC2NP_Msk,
                    TIM_CCER_CC2E);

        break;

    case TIM_CH3:
        modify_bits(base->CCMR2,
                    TIM_CCMR2_OC3M_Msk,
                    TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC3E_Msk | TIM_CCER_CC3P_Msk | TIM_CCER_CC3NE_Msk | TIM_CCER_CC3NP_Msk,
                    TIM_CCER_CC3E);

        break;

    case TIM_CH4:
        modify_bits(base->CCMR2,
                    TIM_CCMR2_OC4M_Msk,
                    TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC4E_Msk | TIM_CCER_CC4P_Msk,
                    TIM_CCER_CC4E);

        break;

    case TIM_CH1N:
        modify_bits(base->CCMR1,
                    TIM_CCMR1_OC1M_Msk,
                    TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC1E_Msk | TIM_CCER_CC1P_Msk | TIM_CCER_CC1NE_Msk | TIM_CCER_CC1NP_Msk,
                    TIM_CCER_CC1NE);

        break;

    case TIM_CH2N:
        modify_bits(base->CCMR1,
                    TIM_CCMR1_OC2M_Msk,
                    TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC2E_Msk | TIM_CCER_CC2P_Msk | TIM_CCER_CC2NE_Msk | TIM_CCER_CC2NP_Msk,
                    TIM_CCER_CC2NE);

        break;

    case TIM_CH3N:
        modify_bits(base->CCMR2,
                    TIM_CCMR2_OC3M_Msk,
                    TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_1);
        modify_bits(base->CCER,
                    TIM_CCER_CC3E_Msk | TIM_CCER_CC3P_Msk | TIM_CCER_CC3NE_Msk | TIM_CCER_CC3NP_Msk,
                    TIM_CCER_CC3NE);

        break;

    default:
        break;
    }

    if ((base == TIM1)
#if defined(TIM8)
        || (base == TIM8)
#endif
#if defined(TIM9)
        || (base == TIM9)
#endif
#if defined(TIM10)
        || (base == TIM10)
#endif
    )
    {
        set_bits(base->BDTR, TIM_BDTR_MOE);
        sync_peripheral(&base->BDTR);
    }
}

__STATIC_INLINE void tim_setup_freerunning(TIM_TypeDef *base)
{
    base->ARR = 0xffff;

    tim_generate_update(base);
}

__STATIC_INLINE void tim_setup_linked(TIM_TypeDef *base_master, TIM_TypeDef *base_slave, uint8_t trigger_connection)
{
    set_bits(base_master->CR2, TIM_CR2_MMS_UPDATE);
    base_master->ARR = 0xffff;

    set_bits(base_slave->SMCR, (trigger_connection << TIM_SMCR_TS_Pos) | TIM_SMCR_SMS_ECM1);
    base_slave->ARR = 0xffff;

    tim_generate_update(base_master);
}

__STATIC_INLINE void tim_setup_dma(TIM_TypeDef *base)
{
    set_bits(base->DIER, TIM_DIER_UDE);
}

// IWDG

__STATIC_INLINE void iwdg_unlock(void)
{
    IWDG->KR = 0x5555;
}

__STATIC_INLINE void iwdg_start(void)
{
    IWDG->KR = 0xcccc;
}

__STATIC_INLINE void iwdg_reload(void)
{
    IWDG->KR = 0xaaaa;
}

// RTC

#if defined(STM32G0) || defined(STM32L4)
#define RCC_BDCR_RTCSEL_NOCLOCK (0x00000000U) /*!< No clock */
#define RCC_BDCR_RTCSEL_LSE (0x00000100U)     /*!< LSE oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_LSI (0x00000200U)     /*!< LSI oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_HSE (0x00000300U)     /*!< HSE oscillator clock divided by 128 used as RTC clock */
#endif

__STATIC_INLINE void rtc_disable_backup_domain_write_protection(void)
{
#if defined(STM32F0) || defined(STM32F1)
    set_bits(PWR->CR, PWR_CR_DBP);
    sync_peripheral(&PWR->CR);
#elif defined(STM32G0) || defined(STM32L4)
    set_bits(PWR->CR1, PWR_CR1_DBP);
    sync_peripheral(&PWR->CR1);
#endif
}

__STATIC_INLINE void rtc_enable_lse(void)
{
    set_bits(RCC->BDCR, RCC_BDCR_LSEON);
}

__STATIC_INLINE bool rtc_is_lse_ready(void)
{
    return get_bits(RCC->BDCR, RCC_BDCR_LSERDY);
}

__STATIC_INLINE bool rtc_is_enabled(void)
{
    return get_bits(RCC->BDCR, RCC_BDCR_RTCEN);
}

__STATIC_INLINE void rtc_enable(void)
{
    modify_bits(RCC->BDCR,
                RCC_BDCR_RTCSEL_Msk,
                RCC_BDCR_RTCSEL_LSE);

    set_bits(RCC->BDCR, RCC_BDCR_RTCEN);
}

__STATIC_INLINE void rtc_enter_configuration_mode(void)
{
#if defined(STM32F0)
    RTC->WPR = 0xca;
    RTC->WPR = 0x53;

    set_bits(RTC->ISR, RTC_ISR_INIT);
    wait_until_bits_set(RTC->ISR, RTC_ISR_INITF);
#elif defined(STM32F1)
    wait_until_bits_set(RTC->CRL, RTC_CRL_RTOFF);

    set_bits(RTC->CRL, RTC_CRL_CNF);
#elif defined(STM32G0)
    RTC->WPR = 0xca;
    RTC->WPR = 0x53;

    set_bits(RTC->ICSR, RTC_ICSR_INIT);
    wait_until_bits_set(RTC->ICSR, RTC_ICSR_INITF);
#elif defined(STM32L4)
    RTC->WPR = 0xca;
    RTC->WPR = 0x53;

    set_bits(RTC->ISR, RTC_ISR_INIT);
    wait_until_bits_set(RTC->ISR, RTC_ISR_INITF);
#endif
}

__STATIC_INLINE void rtc_leave_configuration_mode(void)
{
#if defined(STM32F0)
    clear_bits(RTC->ISR, RTC_ISR_INIT);

