Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
    RTC->WPR = 0xfe;
    RTC->WPR = 0x64;
#elif defined(STM32F1)
    clear_bits(RTC->CRL, RTC_CRL_CNF);

    wait_until_bits_set(RTC->CRL, RTC_CRL_RTOFF);
#elif defined(STM32G0)
    clear_bits(RTC->ICSR, RTC_ICSR_INIT);

    RTC->WPR = 0xfe;
    RTC->WPR = 0x64;
#elif defined(STM32L4)
    clear_bits(RTC->ISR, RTC_ISR_INIT);

    RTC->WPR = 0xfe;
    RTC->WPR = 0x64;
#endif
}

#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)

__STATIC_INLINE void rtc_get_date_time(uint32_t *dr, uint32_t *tr)
{
    *tr = RTC->TR;
    *dr = RTC->DR;
}

__STATIC_INLINE void rtc_set_date_time(uint32_t dr, uint32_t tr)
{
    RTC->TR = tr;
    RTC->DR = dr;
}

#elif defined(STM32F1)

__STATIC_INLINE void rtc_set_prescaler_factor(uint32_t value)
{
    value--;

    RTC->PRLH = (value >> 16) & 0xffff;
    RTC->PRLL = value & 0xffff;
}

__STATIC_INLINE uint32_t rtc_get_count(void)
{
    volatile uint32_t countHigh1 = RTC->CNTH;
    volatile uint32_t count = RTC->CNTL;
    volatile uint32_t countHigh2 = RTC->CNTH;

    if (countHigh1 == countHigh2)
        return count | (countHigh1 << 16);
    else
    {
        if (count & 0x8000)
            return count | (countHigh1 << 16);
        else
            return count | (countHigh2 << 16);
    }
}

__STATIC_INLINE void rtc_set_count(uint32_t value)
{
    RTC->CNTL = 0;
    RTC->CNTH = (value >> 16) & 0xffff;
    RTC->CNTL = value & 0xffff;
}

#endif

// USART

#define USART_CR1_M_8BITS 0
#define USART_CR1_M_9BITS USART_CR1_M

#define USART_CR1_PCE_NONE 0
#define USART_CR1_PCE_EVEN USART_CR1_PCE

#define USART_CR2_STOP_0_5BIT USART_CR2_STOP_0
#define USART_CR2_STOP_1BIT 0
#define USART_CR2_STOP_1_5BIT (USART_CR2_STOP_1 | USART_CR2_STOP0)
#define USART_CR2_STOP_2BIT USART_CR2_STOP_1

__STATIC_INLINE void usart_setup_8n1(USART_TypeDef *base, uint32_t baud_rate)
{
    base->BRR = baud_rate;
    base->CR1 = USART_CR1_UE |       // Enable USART
                USART_CR1_M_8BITS |  // 8 bits
                USART_CR1_PCE_NONE | // Parity none
                USART_CR1_TE |       // Enable transmitter
                USART_CR1_RE;        // Enable receiver
    base->CR2 = USART_CR2_STOP_1BIT; // 1 stop bit
    base->CR3 = 0;                   // No flow control
}

__STATIC_INLINE void usart_enable_receive_interrupt(USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    set_bits(base->CR1, USART_CR1_RXNEIE);
#elif defined(STM32G0)
    set_bits(base->CR1, USART_CR1_RXNEIE_RXFNEIE);
#endif
}

__STATIC_INLINE void usart_disable_receive_interrupt(USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    clear_bits(base->CR1, USART_CR1_RXNEIE);
#elif defined(STM32G0)
    clear_bits(base->CR1, USART_CR1_RXNEIE_RXFNEIE);
#endif
}

__STATIC_INLINE bool usart_is_receive_interrupt_enabled(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    return get_bits(base->CR1, USART_CR1_RXNEIE);
#elif defined(STM32G0)
    return get_bits(base->CR1, USART_CR1_RXNEIE_RXFNEIE);
#endif
}

__STATIC_INLINE void usart_enable_transmit_interrupt(USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    set_bits(base->CR1, USART_CR1_TXEIE);
#elif defined(STM32G0)
    set_bits(base->CR1, USART_CR1_TXEIE_TXFNFIE);
#endif
}

__STATIC_INLINE void usart_disable_transmit_interrupt(USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    clear_bits(base->CR1, USART_CR1_TXEIE);
#elif defined(STM32G0)
    clear_bits(base->CR1, USART_CR1_TXEIE_TXFNFIE);
#endif
}

__STATIC_INLINE bool usart_is_transmit_interrupt_enabled(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32F1) || defined(STM32L4)
    return get_bits(base->CR1, USART_CR1_TXEIE);
#elif defined(STM32G0)
    return get_bits(base->CR1, USART_CR1_TXEIE_TXFNFIE);
#endif
}

__STATIC_INLINE bool usart_is_receive_ready(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32L4)
    return get_bits(base->ISR, USART_ISR_RXNE);
#elif defined(STM32F1)
    return get_bits(base->SR, USART_SR_RXNE);
#elif defined(STM32G0)
    return get_bits(base->ISR, USART_ISR_RXNE_RXFNE);
#endif
}

__STATIC_INLINE bool usart_is_send_ready(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32L4)
    return get_bits(base->ISR, USART_ISR_TXE);
#elif defined(STM32F1)
    return get_bits(base->SR, USART_SR_TXE);
#elif defined(STM32G0)
    return get_bits(base->ISR, USART_ISR_TXE_TXFNF);
#endif
}

__STATIC_INLINE bool usart_is_overrun(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    return get_bits(base->ISR, USART_ISR_ORE);
#elif defined(STM32F1)
    return get_bits(base->SR, USART_SR_ORE);
#endif
}

__STATIC_INLINE void usart_clear_overrun(USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    set_bits(base->ICR, USART_ICR_ORECF);
#elif defined(STM32F1)
    base->DR;
#endif
}

__STATIC_INLINE uint16_t usart_receive(const USART_TypeDef *base)
{
#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    return base->RDR;
#elif defined(STM32F1)
    return base->DR;
#endif
}

__STATIC_INLINE uint16_t usart_receive_blocking(const USART_TypeDef *base)
{
    while (!usart_is_receive_ready(base))
        ;
    return usart_receive(base);
}

__STATIC_INLINE void usart_send(USART_TypeDef *base, uint16_t data)
{
#if defined(STM32F0) || defined(STM32G0) || defined(STM32L4)
    base->TDR = data;
#elif defined(STM32F1)
    base->DR = data;
#endif
}

__STATIC_INLINE void usart_send_blocking(USART_TypeDef *base, uint16_t data)
{
    while (!usart_is_send_ready(base))
        ;
    usart_send(base, data);
}

// SPI

__STATIC_INLINE void spi_wait_until_transmitter_empty(const SPI_TypeDef *base)
{
    wait_until_bits_set(base->SR, SPI_SR_TXE);
}

__STATIC_INLINE void spi_wait_while_busy(const SPI_TypeDef *base)
{
    wait_until_bits_clear(base->SR, SPI_SR_BSY);
}

__STATIC_INLINE void spi_send(SPI_TypeDef *base,
                              uint16_t data)
{
    spi_wait_until_transmitter_empty(base);

