Gissio/radpro/platform.io/lib/stm32/stm32-ext.h
    base->DR = data;
}

__STATIC_INLINE void spi_setup(SPI_TypeDef *base)
{
    base->CR1 = SPI_CR1_CPHA |
                SPI_CR1_CPOL |
                SPI_CR1_MSTR |
                SPI_CR1_SSI |
                SPI_CR1_SSM;
}

__STATIC_INLINE void spi_enable(SPI_TypeDef *base)
{
    set_bits(base->CR1, SPI_CR1_SPE);
}

// DMA

__STATIC_INLINE void dma_setup_memory32_to_peripheral32(DMA_Channel_TypeDef *channel, uint32_t *dest, uint32_t *source, uint32_t count)
{
    channel->CCR = DMA_CCR_DIR |
                   DMA_CCR_MINC |
                   (0b10 << DMA_CCR_PSIZE_Pos) |
                   (0b10 << DMA_CCR_MSIZE_Pos);
    channel->CNDTR = count;
    channel->CMAR = (uint32_t)source;
    channel->CPAR = (uint32_t)dest;
}

__STATIC_INLINE bool dma_is_active(const DMA_Channel_TypeDef *channel)
{
    return (channel->CNDTR != 0);
}

__STATIC_INLINE void dma_enable(DMA_Channel_TypeDef *channel)
{
    __DSB();

    set_bits(channel->CCR, DMA_CCR_EN);
}

__STATIC_INLINE void dma_disable(DMA_Channel_TypeDef *channel)
{
    clear_bits(channel->CCR, DMA_CCR_EN);
}

// USB

#if defined(CH32)

#define EXTEN_BASE (AHBPERIPH_BASE + 0x00003800UL)

typedef struct
{
    __IO uint32_t CTR;      // Configuration extend control register,    Address offset: 0x00
    __IO uint32_t RESERVED; // Reserved,                                 Address offset: 0x04
    __IO uint32_t CTR2;     // Configuration extend control register 2,  Address offset: 0x08
} EXTEN_CH32_TypeDef;

#define EXTEN ((EXTEN_CH32_TypeDef *)EXTEN_BASE)

#define EXTEN_CTR_USBDPU_Pos (1U)
#define EXTEN_CTR_USBDPU_Msk (0x1UL << EXTEN_CTR_USBDPU_Pos) // 0x00000002
#define EXTEN_CTR_USBDPU EXTEN_CTR_USBDPU_Msk                // USB D+ Pull-up

#define EXTEN_CTR

__STATIC_INLINE void usb_enable_pullup()
{
    set_bits(EXTEN->CTR, EXTEN_CTR_USBDPU);
}

__STATIC_INLINE void usb_disable_pullup()
{
    clear_bits(EXTEN->CTR, EXTEN_CTR_USBDPU);
}

#endif

// ROM

#if defined(STM32F0)
#define TS_CAL1 (*((__I uint16_t *)0x1ffff7b8))
#define TS_CAL2 (*((__I uint16_t *)0x1ffff7c2))
#define VREFINT_CAL_VALUE (*((__I uint16_t *)0x1ffff7ba))
#define VREFINT_CAL_VOLTAGE 3.3F
#define VREFINT_VOLTAGE 1.2F
#elif defined(STM32F1)
#define VREFINT_VOLTAGE 1.2F
#elif defined(STM32G0)
#define TS_CAL1 (*((__I uint16_t *)0x1fff75a8))
#define VREFINT_CAL_VALUE (*((__I uint16_t *)0x1fff75aa))
#define VREFINT_CAL_VOLTAGE 3.0F
#elif defined(STM32L4)
#define TS_CAL1 (*((__I uint16_t *)0x1fff75a8))
#define TS_CAL2 (*((__I uint16_t *)0x1fff75ca))
#define VREFINT_CAL_VALUE (*((__I uint16_t *)0x1fff75aa))
#define VREFINT_CAL_VOLTAGE 3.0F
#endif

#define UID0 (((__I uint32_t *)UID_BASE)[0])
#define UID1 (((__I uint32_t *)UID_BASE)[1])
#define UID2 (((__I uint32_t *)UID_BASE)[2])

#endif
